package com.wyd.elk_solr.lesson2;

public class Test {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		String aString = "{\"id\":1,\"name\":\"银花 感冒 颗粒\",\"funciton\":\"功能主治：银花感冒颗粒 ，头痛,清热，解表，利咽。\"}" +"\n"+
				"{\"id\":2,\"name\":\"感冒  止咳糖浆\",\"funciton\":\"功能主治：感冒止咳糖浆,解表清热，止咳化痰。\"}" +"\n"+
				"{\"id\":3,\"name\":\"感冒灵颗粒\",\"funciton\":\"功能主治：解热镇痛。头痛 ,清热。\"}" +"\n"+
				"{\"id\":4,\"name\":\"感冒  灵胶囊\",\"funciton\":\"功能主治：银花感冒颗粒 ，头痛,清热，解表，利咽。\"}" +"\n"+
				"{\"id\":5,\"name\":\"仁和 感冒 颗粒\",\"funciton\":\"功能主治：疏风清热，宣肺止咳,解表清热，止咳化痰。\"}" +"\n"+
				"查询到记录数=5" +"\n"+
				"(4)药品名称:感冒  灵胶囊        功能主治：银花感冒颗粒 ，头痛,清热，解表，利咽。" +"\n"+
				"(1)药品名称:银花 感冒 颗粒        功能主治：银花感冒颗粒 ，头痛,清热，解表，利咽。" +"\n"+
				"(2)药品名称:感冒  止咳糖浆        功能主治：感冒止咳糖浆,解表清热，止咳化痰。" +"\n"+
				"(3)药品名称:感冒灵颗粒        功能主治：解热镇痛。头痛 ,清热。" +"\n"+
				"(5)药品名称:仁和 感冒 颗粒        功能主治：疏风清热，宣肺止咳,解表清热，止咳化痰。";
		System.out.println(aString);
	}

}
